{
    "abap": {
        "name": "ABAP",
        "source": "https://en.wikipedia.org/wiki/ABAP",
        "website": "https://community.sap.com/topics/abap",
        "description": "ABAP (Advanced Business Application Programming, originally Allgemeiner Berichts-Aufbereitungs-Prozessor, German for \"general report creation processor\") is a high-level programming language created by the German software company SAP SE. It is extracted from the base computing languages Java, C, C++ and Python."
    },
    "binary": {
        "name": "Binary",
        "website": "https://en.wikipedia.org/wiki/Binary_file",
        "description": "A binary file is a computer file that contains only binary digits (bits). The term \"binary\" comes from the fact that these files contain data expressed in base-2 numeral system. Binary files are often contrasted with text files, which contain human-readable characters encoded using some character encoding scheme. Binary files are often used to store machine code, which is the basic instructions that a computer understands."
    },
    "c": {
        "name": "C",
        "website": "https://en.wikipedia.org/wiki/C_(programming_language)",
        "description": "C is an imperative procedural language. It was designed to be compiled to provide low-level access to memory and language constructs that map efficiently to machine instructions, all with minimal runtime support. Despite its low-level capabilities, the language was designed to encourage cross-platform programming. A standards-compliant C program written with portability in mind can be compiled for a wide variety of computer platforms and operating systems with few changes to its source code."
    },
    "ci": {
        "name": "Continuous Integration",
        "website": "https://en.wikipedia.org/wiki/Continuous_integration",
        "description": "Continuous integration (CI) is the practice of merging all developer working copies to a shared mainline several times a day. Each integration can then be verified by an automated build (including test) to detect integration errors as quickly as possible. Many teams find that this approach leads to significantly reduced integration problems and allows a team to develop cohesive software more rapidly."
    },
    "configfile": {
        "name": "Config File",
        "website": "https://en.wikipedia.org/wiki/Configuration_file",
        "description": "A configuration file is a file used to store configuration data for some computer software. It is used to set up the initial state of a program, or to change the state of a running program. The configuration file is usually a plain text file, but it may also be a binary file. The format of the file is determined by the program that uses it. The file is usually named with a .conf, .cfg, .ini, or .config extension."
    },
    "container": {
        "name": "Container",
        "website": "https://en.wikipedia.org/wiki/Containerization_(computing)",
        "description": "Linux containers are a way to run isolated Linux systems (containers) on a single Linux server. Containers are very lightweight and fast because they share the kernel of the host system. Each container can have its own users, file systems, applications, and configuration files."
    },
    "cpp": {
        "name": "C++",
        "source": "https://en.wikipedia.org/wiki/C%2B%2B",
        "website": "https://isocpp.org/",
        "description": "C++ is a general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language, or \"C with Classes\". The language has expanded significantly over time, and modern C++ now has object-oriented, generic, and functional features in addition to facilities for low-level memory manipulation. It is almost always implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Oracle, and IBM, so it is available on many platforms."
    },
    "c#": {
        "name": "C#",
        "source": "https://en.wikipedia.org/wiki/C_Sharp_(programming_language)",
        "website": "https://docs.microsoft.com/en-us/dotnet/csharp/",
        "description": "C# (pronounced see sharp, like the musical note C♯, but written with the number sign) is a general-purpose, multi-paradigm programming language encompassing strong typing, lexically scoped, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines. It was developed around 2000 by Microsoft as part of its .NET initiative and later approved as an international standard by Ecma (ECMA-334) in 2002 and ISO (ISO/IEC 23270) in 2003."
    },
    "css": {
        "name": "CSS",
        "website": "https://www.w3.org/TR/CSS/#css",
        "description": "CSS (Cascading Style Sheets) is a style sheet language used for describing the presentation of a document written in a markup language. A style sheet is a collection of rules that tells a web browser how to display an HTML document."
    },
    "dotnet": {
        "name": ".NET",
        "source": "https://en.wikipedia.org/wiki/.NET_Framework",
        "website": "https://dotnet.microsoft.com/",
        "description": ".NET Framework (pronounced as \"dot net\") is a software framework developed by Microsoft that runs primarily on Microsoft Windows. It includes a large class library called Framework Class Library (FCL) and provides language interoperability (each language can use code written in other languages) across several programming languages."
    },
    "go": {
        "name": "Go",
        "source": "https://en.wikipedia.org/wiki/Go_(programming_language)",
        "website": "https://golang.org/",
        "description": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. Go is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency. The language is often referred to as \"Golang\" because of its domain name, golang.org, but the proper name is Go."
    },
    "groovy": {
        "name": "Groovy",
        "website": "http://groovy.codehaus.org/",
        "description": "The Groovy programming language is a powerful, dynamic language that makes writing code easy and fun. It has a simple syntax that is easy to learn, and its features include closures, comprehensions, metaprogramming, and more. Groovy also integrates well with Java code, making it an ideal choice for developing Java applications."
    },
    "html": {
        "name": "HTML",
        "website": "https://www.w3.org/TR/html/",
        "description": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript)."
    },
    "java": {
        "name": "Java",
        "source": "https://en.wikipedia.org/wiki/Java_(programming_language)",
        "website": "https://www.java.com",
        "description": "Java is a class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let application developers write once, run anywhere ... meaning that compiled Java code can run on all platforms that support Java without the need for recompilation. Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but it has fewer low-level facilities than either of them."
    },
    "javascript": {
        "name": "JavaScript",
        "source": "https://en.wikipedia.org/wiki/JavaScript",
        "website": "https://en.wikipedia.org/wiki/JavaScript",
        "description": "Alongside HTML and CSS, JavaScript is one of the core technologies of the World Wide Web. JavaScript enables interactive web pages and is an essential part of web applications. The vast majority of websites use it for client-side page behavior, and all major web browsers have a dedicated JavaScript engine to execute it."
    },
    "json": {
        "name": "JSON",
        "source": "https://en.wikipedia.org/wiki/JSON",
        "website": "https://www.json.org/",
        "description": "JSON (JavaScript Object Notation) is a lightweight data-interchange format. It is easy for humans to read and write. It is easy for machines to parse and generate. It is based on a subset of the JavaScript Programming Language Standard ECMA-262 3rd Edition - December 1999. JSON is a text format that is completely language independent but uses conventions that are familiar to programmers of the C-family of languages, including C, C++, C#, Java, JavaScript, Perl, Python, and many others. These properties make JSON an ideal data-interchange language."
    },
    "kotlin": {
        "name": "Kotlin",
        "website": "https://kotlinlang.org/",
        "description": "Kotlin is a statically typed programming language that runs on the Java virtual machine and also can be compiled to JavaScript. Kotlin was created by JetBrains, a company best known for creating the IntelliJ IDEA integrated development environment (IDE). Kotlin is designed to interoperate with Java code and libraries, but also can be used for standalone applications."
    },
    "kubernetes": {
        "name": "Kubernetes",
        "website": "https://kubernetes.io/",
        "description": "Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications. It groups containers that make up an application into logical units for easy management and discovery. Kubernetes builds upon 15 years of experience of running production workloads at Google, combined with best-of-breed ideas and practices from the community. It is said to be notoriously difficult to manage Kubernetes clusters, which is why there are many tools and services to help with this task."
    },
    "lua": {
        "name": "Lua",
        "website": "https://www.lua.org/",
        "description": "Lua is a powerful, lightweight programming language designed for extending applications. It has been used in video games, mobile apps, and web development. Lua's simple syntax and efficient use of memory make it an ideal choice for scripting."
    },
    "markdown": {
        "name": "Markdown",
        "website": "https://daringfireball.net/projects/markdown/",
        "description": "Markdown is a lightweight markup language with plain text formatting syntax. Its design allows it to be converted to many output formats, but the original tool by the same name only supports HTML. Markdown is often used to format readme files, for writing messages in online discussion forums, and to create rich text using a plain text editor."
    },
    "mobile": {
        "name": "Mobile",
        "website": "https://en.wikipedia.org/wiki/Mobile_app",
        "description": "A mobile app or mobile application is a computer program or software application designed to run on a mobile device such as a phone, tablet, or watch. Mobile applications often stand in contrast to desktop applications which run on desktop computers, and with web applications which run in mobile web browsers rather than directly on the mobile device."
    },
    "nodejs": {
        "name": "Node.js",
        "website": "https://nodejs.org",
        "description": "Node.js is a runtime environment and library for running JavaScript applications outside of the browser. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices."
    },
    "perl": {
        "name": "Perl",
        "website": "http://www.perl.org/",
        "description": "The Perl programming language is a powerful tool for solving problems. It is easy to learn, and has many modules that allow you to do complex tasks with just a few lines of code. Perl also has a huge community of users who are always willing to help out."
    },
    "php": {
        "name": "PHP",
        "source": "https://en.wikipedia.org/wiki/PHP",
        "website": "https://www.php.net/",
        "description": "PHP is a general-purpose scripting language especially suited to web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1994; (...). PHP originally stood for Personal Home Page, but it now stands for the recursive initialism PHP: Hypertext Preprocessor. (...) PHP code is usually processed on a web server by a PHP interpreter implemented as a module, a daemon or as a Common Gateway Interface (CGI) executable."
    },
    "plsql": {
        "name": "PL/SQL",
        "website": "https://www.oracle.com/technetwork/database/application-development/plsql/overview/index.html",
        "description": "PL/SQL is a powerful programming language that enables developers to create robust and reliable applications. It has a rich set of features that makes it an ideal choice for developing enterprise-level applications. PL/SQL also offers excellent performance, making it the perfect choice for high-traffic websites and systems."
    },
    "powershell": {
        "name": "PowerShell",
        "source": "https://en.wikipedia.org/wiki/PowerShell",
        "website": "https://en.wikipedia.org/wiki/PowerShell",
        "description": "PowerShell is a task automation and configuration management framework from Microsoft, consisting of a command-line shell and associated scripting language. Initially a Windows component only, known as Windows PowerShell, it was made open-source and cross-platform on 18 August 2016 with the introduction of PowerShell Core. The former is built on the .NET Framework, the latter on .NET Core."
    },
    "protobuf": {
        "name": "Protocol Buffers",
        "source": "https: //en.wikipedia.org/wiki/Protocol_Buffers",
        "website": "https://developers.google.com/protocol-buffers/",
        "description": "Protocol Buffers (Protobuf) is a method of serializing structured data. It is useful in developing programs to communicate with each other over a wire or for storing data.  The method involves an interface description language that describes the structure of some data and a program that generates source code from that description for generating or parsing a stream of bytes that represents the structured data. Google developed Protocol Buffers for internal use and provided a code generator for multiple languages under an open source license."
    },
    "python": {
        "name": "Python",
        "source": "https://en.wikipedia.org/wiki/Python_(programming_language)",
        "website": "https://www.python.org/",
        "description": "Python is an interpreted, high-level and general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python's design philosophy emphasizes code readability with its notable use of significant whitespace. Its language constructs and object-oriented approach aim to help programmers write clear, logical code for small and large-scale projects. Python is dynamically typed and garbage-collected. It supports multiple programming paradigms, including structured (particularly, procedural), object-oriented, and functional programming. Python is often described as a \"batteries included\" language due to its comprehensive standard library."
    },
    "r": {
        "name": "R",
        "website": "https://www.r-project.org/",
        "description": "There are many programming languages to choose from, but R is a unique option. It's specifically designed for data analysis, so it's perfect for scientists and statisticians. Additionally, the R community is very active and supportive, so you can always find help when you need it."
    },
    "ruby": {
        "name": "Ruby",
        "source": "https://en.wikipedia.org/wiki/Ruby_(programming_language)",
        "website": "https://www.ruby-lang.org",
        "description": "Ruby is an interpreted, high-level, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro Matsumoto in Japan. Ruby is dynamically typed and uses garbage collection. It supports multiple programming paradigms, including procedural, object-oriented, and functional programming. According to the creator, Ruby was influenced by Perl, Smalltalk, Eiffel, Ada, Basic, and Lisp."
    },
    "rust": {
        "name": "Rust",
        "source": "https://en.wikipedia.org/wiki/Rust_(programming_language)",
        "website": "https://www.rust-lang.org/",
        "description": "Rust is a multi-paradigm programming language focused on performance and safety, especially safe concurrency. Rust is syntactically similar to C++, and provides memory safety without using garbage collection. Rust was originally designed by Graydon Hoare at Mozilla Research, with contributions from Dave Herman, Brendan Eich, and others. The designers refined the language while writing the Servo layout or browser engine, and the Rust compiler. It has gained increasing use in industry, and Microsoft has been experimenting with the language for secure and safety-critical software components. Rust has been named the \"most loved programming language\" in the Stack Overflow Developer Survey every year since 2016."
    },
    "security": {
        "name": "Security",
        "website": "https://en.wikipedia.org/wiki/Security",
        "description": "Building applications today is a complex task which involves many technologies and dependencies. Keeping dependencies updated to avoid security vulnerabilities is an ongoing task and a maintainance burden. To ease the process, there are a number of tools which check for common security vulnerabilities and suggest fixes and updates. These tools are sometimes called \"vulnerability scanners\" or \"vulnerability checkers\". Below you can find a list of the most popular tools."
    },
    "sql": {
        "name": "SQL",
        "website": "https://www.w3schools.com/sql/default.asp",
        "description": "There are many programming languages in the world, but SQL is one of the most important ones. It is used to communicate with databases, making it essential for managing and querying data. SQL is easy to learn and use, making it a popular choice for developers."
    },
    "swift": {
        "name": "Swift",
        "website": "https://swift.org/",
        "description": "Swift is a powerful programming language that makes development on Apple products faster and easier. It has been designed to work with Cocoa and Cocoa Touch, making it the perfect choice for developing apps for iPhone, iPad, Mac, and Apple Watch. Swift is also open source, which means that developers can contribute to its improvement."
    },
    "typescript": {
        "name": "TypeScript",
        "source": "https://en.wikipedia.org/wiki/TypeScript",
        "website": "https://www.typescriptlang.org/",
        "description": "TypeScript is an open-source programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript and adds optional static typing to the language. TypeScript is designed for development of large applications and transcompiles to JavaScript. As TypeScript is a superset of JavaScript, existing JavaScript programs are also valid TypeScript programs."
    },
    "vbnet": {
        "name": "Visual Basic .NET",
        "source": "https://en.wikipedia.org/wiki/Visual_Basic",
        "website": "https://docs.microsoft.com/en-us/dotnet/visual-basic/",
        "description": "Visual Basic .NET (VB.NET) is a multi-paradigm, object-oriented programming language, implemented on the .NET Framework. VB.NET was developed by Microsoft to combine the power of .NET Framework with the productivity of Visual Basic. It is syntactically similar to Visual Basic but has more structured programming features, such as procedures, classes, and modules. VB.NET is a component-based programming language that is designed to provide a simple programming environment for developers. It is a general-purpose, object-oriented programming language that can be used to create Windows and Web applications."
    },
    "vue": {
        "name": "Vue.js",
        "source": "https://en.wikipedia.org/wiki/Vue.js",
        "website": "https://vuejs.org/",
        "description": "Vue.js (commonly referred to as Vue; pronounced /vjuː/, like \"view\") is an open-source model–view–viewmodel front end JavaScript framework for building user interfaces and single-page applications. It was created by Evan You, and is maintained by him and the rest of the active core team members coming from various companies such as Netlify and Netguru."
    },
    "writing": {
        "name": "Writing",
        "website": "https://en.wikipedia.org/wiki/Writing",
        "description": "Writing is a powerful way to communicate ideas and information. It is a skill that can be learned and improved. Below you can find a list of tools to help you improve your writing skills. These are especially helpful for technical writing, such as documentation, blog posts, and articles."
    },
    "xml": {
        "name": "XML",
        "source": "https://en.wikipedia.org/wiki/XML",
        "website": "https://www.w3.org/XML/",
        "description": "XML is a markup language that defines a set of rules for encoding documents in a format that is both human-readable and machine-readable. It is defined in the XML 1.0 Specification produced by the W3C, and several other related specifications, all of which are free open standards. The design goals of XML emphasize simplicity, generality, and usability across the Internet. It is a textual data format with strong support via Unicode for the languages of the world. Although the design of XML focuses on documents, it is widely used for the representation of arbitrary data structures, for example in web services. It is a W3C Recommendation and is maintained by the XML Activity."
    }
}
